//******************************************//
//*	名　前：ObjectBase.cpp
//*	内　容：オブジェクトのベースクラス
//*	日　付：2017.5.2
//*	制作者：N.Shibayama
//******************************************//

#include "ObjectBase.h"

//==================================//
//内容		コンストラクタ
//引数		なし
//戻り値	なし
//==================================//
ObjectBase::ObjectBase()
{
}

//==================================//
//内容		デストラクタ
//引数		なし
//戻り値	なし
//==================================//
ObjectBase::~ObjectBase()
{
}

//==================================//
//内容		更新
//引数		なし
//戻り値	なし
//==================================//
void ObjectBase::Update()
{
	m_posX += m_spdX;
	m_posY += m_spdY;
}

//==================================//
//内容		描画
//引数		なし
//戻り値	なし
//==================================//
void ObjectBase::Render()
{
}

